Revit 2027 API
MEPNetworkSegmentData.PressureDrop Property
 The calculated pressure drop of this segment, in kg/(ft*s^2).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PressureDrop { get; }
Public ReadOnly Property PressureDrop As Double
	Get
public:
property double PressureDrop {
	double get ();
}
member PressureDrop : float with get
Property Value
Double
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace